#+title: Lab2
#+PROPERTY: header-args :results pp

Welcome to Lab2 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*

[[org:../repos/labs/DrupalDay2024/lab1.org][Lab1 is a pre-requirement before starting Lab2]]


** Step 1: Prepare HostPath Directory


   Create a directory on your host system to store Drupal files and database persistently.
   #+BEGIN_SRC bash
   mkdir -p $MYHOSTPATH
   cd $MYHOSTPATH
   ls -larth
   pwd
   #+END_SRC

   #+RESULTS:
   : total 76K
   : drwxrwxr-x 24 ricardo ricardo  68K out  5 17:35 ..
   : drwxrwxr-x  2 ricardo ricardo 4,0K out  5 17:35 .
   : /home/ricardo/tmp/lab1


   Replace $MYHOSTPATH with the actual path where you want to store your data.

